import os
import random
import time
os.system ("cls")
hp_inimigo = 100
hp_jogador = 100
batalha_ativa = True

print("Um Porygon Selvagem apareceu")
porygon = ''' ⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣠⠤⠛⠋⠉⠉⠉⠛⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣠⠶⠓⠂⠀⠀⠠⠤⠤⠀⠀⠙⣆⠀⠀⠀⠀⠀⠀⡠⢤⠀
⠀⠀⢀⢖⡃⠀⠀⠀⠀⢰⠀⣤⡄⠀⠀⠀⣹⠀⠀⠀⠀⢠⠔⠁⣼⠇
⢀⡞⠉⠀⠑⣄⠀⠀⠀⠘⠀⠀⠀⠐⠀⣠⠋⠀⠀⢠⠖⠉⠀⢰⠏⠀
⠈⠻⢄⣀⡀⢀⡇⠀⠀⠀⠀⠀⢀⡠⠟⠛⢤⣀⠜⠋⠀⠀⢠⠃⠀⠀
⠀⣠⣴⠁⢉⣽⠟⠶⠶⠶⠾⡿⠁⡇⠀⠀⠀⠀⠳⣤⠀⢠⠇⠀⠀⠀
⠰⣏⠈⠢⡎⠒⣄⠀⠀⢀⠶⢁⡠⠃⠀⠀⠀⠀⠀⢸⣄⠎⠀⠀⠀⠀
⠀⠈⠑⣤⣧⠀⠈⠑⡄⣾⣴⢋⡔⢫⡉⠉⠉⠉⠉⠙⣦⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠛⣄⠀⡞⢃⡴⠋⠀⠀⢙⠦⠤⠤⠤⠤⠤⢽⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠈⠉⢹⣿⣀⠀⢀⡴⠋⠀⠀⠀⠀⣀⣤⠇⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢸⣇⠈⣶⠊⠀⠀⣀⣠⠤⠒⠋⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⢤⣟⣤⠶⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'''
print(porygon)
mudkip = """⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀          ⢠⣦⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡿⠃⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃⠀⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣄⢠⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡤⠴⠚⠛⠉⠉⣁⡈⠉⠉⠛⠓⠦⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢠⣤⡀⠀⠀⠀⠀⠀⠀⣠⡴⠊⠁⠀⠀⠀⠀⠀⠀⠈⠃⠀⠀⠀⠀⠀⠀⠙⠳⣄⠀⠀⠀⠀⠀⠀⠀⢠⣄⠀⠀⠀
⠀⠀⠀⢸⠀⠙⢦⠀⠀⠀⣠⣾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣷⡄⠀⠀⠀⣠⡞⠉⣹⠀⠀⠀
⠀⠀⠀⠸⡄⠀⠀⠳⣄⡸⠃⢸⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣟⠹⡄⢠⡞⠋⠀⣰⡇⠀⠀⠀
⠀⠀⠀⠀⣿⠀⢂⢠⡝⠃⠀⢸⠀⠀⢠⠤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡤⢤⡀⠀⢸⡏⠀⠙⣿⠄⠀⠤⣟⠀⠀⠀⠀
⠀⠀⣠⠞⠁⠀⠀⢸⠃⠀⠀⣸⠀⠀⣿⣶⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣷⣼⣇⠀⢸⠀⡀⠀⢸⡄⠀⠀⠈⠓⣦⡀⠀
⢠⡼⢣⡃⠀⢠⡈⢸⢀⡀⠀⣿⠀⢀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⡏⠀⣿⠀⠆⠀⢸⡇⠀⠀⠀⢄⢈⠳⡄
⠙⠓⠦⢬⣤⣌⣿⢸⣿⡇⠀⣿⡀⠀⠙⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⠟⠁⠀⣿⠀⠀⣶⢸⣷⠀⠑⣤⣴⠷⠞⠋
⠀⠀⠀⠀⣼⠳⣿⣼⡿⢿⣎⣿⣧⣀⠀⠀⠀⠀⠀⠰⡤⠀⠀⢀⡴⠀⠀⠀⠀⠀⢀⣠⣿⠀⢲⣿⣿⢟⣦⣸⢿⠀⠀⠀⠀
⠀⠀⠀⢰⠋⣾⣿⢟⠑⠘⢿⣿⡇⠉⠛⠦⣄⣀⡀⠀⠀⠀⠀⠀⠀⢀⣀⣀⡤⠞⠋⠉⣿⣒⣾⠇⠈⠳⣌⠣⠈⣇⠀⠀⠀
⠀⠀⠀⠯⠴⠟⠑⠀⠀⠀⠈⠹⢷⣤⡀⠀⠀⠉⠉⠛⠛⠒⠒⠒⠛⠋⠉⠁⠀⠀⠀⣀⣻⡿⠃⠀⠀⠀⠈⠓⠦⣼⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣭⡂⠀⢈⠀⠄⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡟⢿⢿⣷⣶⣤⣀⡀⠀⠇⠀⠀⠀⠀⣠⣴⠞⠋⠁⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠀⠈⠈⢘⣛⣷⣄⠀⠀⣀⠀⠀⢀⣴⢿⣄⠀⠀⠀⢸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡟⠀⠀⠀⠀⠀⢁⣽⣧⠀⠀⠀⠀⣿⣧⡤⠀⠀⠀⠀⠀⢿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠁⡀⠀⠀⠀⠀⢈⣭⠟⠒⠒⠒⠚⠿⣿⡆⠀⠀⠀⣀⣤⣼⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣦⠀⠀⠀⠀⢀⣸⡇⠀⠀⠀⠀⠀⠀⠈⢻⡆⠶⠚⣋⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⠶⠶⠶⠾⠛⠁⠀⠀⠀⠀⠀⠀⠀⠈⠻⠶⠶⠾⠿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""
evee = """⠀⢠⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⡼⡌⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⣧⣿⣆⠳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢸⢸⡏⠙⢧⠹⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢸⢸⡇⠀⠈⢳⡘⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠘⡞⡇⠀⠀⠀⢳⠸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢧⢧⠀⠀⠀⢘⣇⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠸⡸⣿⣀⠀⣸⣿⡘⡆⠀⠀⢠⣄⡀⠀⢠⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠤⠤⠤⢖⣒⣒⣚⣩⠟⠀⠀⠀⠀
⠀⠀⢳⡙⣿⣿⣿⣿⡇⣧⣼⡗⢾⡆⠙⠶⢼⠀⠳⣄⣤⠀⠀⠀⠀⠀⠀⠀⢀⡠⠔⢚⣉⣭⠴⠶⠞⠛⠛⢛⡿⢋⡞⠁⠀⠀⠀⠀⠀
⠀⠀⠀⠹⣍⣿⣿⣿⣧⣸⠯⠙⠀⠀⠀⠀⠀⠀⠀⠙⠋⠿⢳⡀⠀⠀⡠⢞⣡⣶⣿⣿⠋⠀⠀⠀⠀⢀⡴⢋⡴⠋⠀⠀⠀⠀⢀⡀⠀
⠀⠀⠀⠀⠈⢦⡙⣿⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⡤⢊⣶⣿⣿⣿⣿⠛⣀⠀⠀⢀⡴⢋⡴⠋⠀⠀⠀⠀⠀⢠⣾⢳⠀
⠀⠀⠀⠀⠀⠀⢉⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠊⡴⢿⣿⣿⣿⣿⣿⣿⣿⡶⠞⣋⠴⠋⠀⠀⠀⠀⠀⢀⡴⠋⠀⠈⡇
⠀⠀⠀⠀⠀⠀⡼⠀⢀⡴⣶⡜⡆⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠟⠛⣛⣛⣉⣉⡩⠤⠔⠚⠁⠀⢀⣀⣀⠤⠔⠚⠁⠀⠀⠀⠀⢧
⠀⠀⠀⠀⠀⠀⡇⠀⣾⣷⣿⡇⠀⠀⠀⠀⠀⠀⠀⠚⣤⢶⡄⠀⠀⠉⡏⠁⠀⠀⠀⠀⣀⠤⠖⠚⠉⠉⠀⠄⠀⠀⢀⡠⠄⠀⠀⠀⢸
⠀⠀⠀⠀⠀⠀⡇⠀⡿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⣾⣧⣾⣷⠀⠀⢸⠁⠀⠀⢀⡴⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⡏
⠀⠀⠀⠀⣀⣴⠃⠀⠳⣭⠟⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡿⠀⠀⡏⠀⠀⢠⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡡⠀⠀⠀⡇
⠀⠀⡠⠊⠁⠹⡄⠀⠀⠀⠀⡀⠀⠺⡖⠀⠀⠀⠸⣏⣛⡿⠃⠀⣸⠥⣀⠀⡜⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠖⠀⢰⠁
⠀⢾⠋⠀⠀⠀⠙⠦⣀⠀⠀⠙⠒⠒⠢⠤⠤⠆⠀⠀⠀⠀⠀⢠⠇⠀⠈⠳⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⡎⠀
⢀⡇⠀⠀⠀⠀⠀⢠⠜⠓⠤⣀⡀⠀⠀⠀⠀⠀⠀⠀⢀⣠⠴⠃⠀⠀⠀⠀⣙⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠃⠀
⢸⣼⡀⠀⠀⠀⡰⠀⠀⢀⠄⠀⠉⠉⠉⠒⠒⠊⠉⠉⠙⣄⠀⠀⠀⠀⠀⠀⢸⡛⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠃⠀⠀
⠈⢻⣇⠀⡀⣸⡁⠀⠠⠏⠀⠀⠀⠀⠀⠀⠀⠀⠘⣆⠀⠸⡆⠀⠀⠀⠀⢸⣿⡇⠈⢳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠜⠁⠀⠀⠀
⠀⠀⠈⠣⣀⣧⠇⠀⡼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⣇⠀⠀⠀⢀⡏⠉⠀⠀⠀⢧⠀⠀⠀⠀⠀⠀⠀⣀⡠⠞⠁⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠈⠻⡄⠳⢹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡸⠀⣰⠃⠀⣀⡴⠋⠀⠀⠀⠀⠀⢸⠑⠒⠒⠒⠒⠚⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠙⢦⡈⢧⠀⠀⠀⠀⠀⠀⠀⠀⢀⠟⡵⢿⡾⠋⠁⢀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠘⡏⠻⡶⣄⠀⠀⠀⠀⣠⣴⡵⠊⠀⢸⠃⢀⣠⣼⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢹⠀⠀⠈⢧⣧⡾⠊⠙⠋⠀⠀⠀⡾⠛⠉⢸⠈⢧⠀⠀⠀⠀⠀⡾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⠀⠀⠈⠛⡇⠀⠀⠀⠄⠀⢰⠃⠀⢀⡼⠀⢸⠇⠀⠀⠀⢀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⡞⠀⢠⠞⠀⢀⡞⠀⠀⠀⠀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⡞⠀⠀⠀⢠⠇⠀⠀⠀⠀⡼⠥⠴⠋⠀⠰⡏⡆⠀⡀⠀⡼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⠿⣄⣇⣀⣏⡄⠀⡀⠀⢸⠃⠀⠀⠀⠀⠀⠑⠓⠴⠧⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⠤⠷⠖⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""
pikachu = """
    ⠸⣷⣦⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠀⠀⠀
⠀⠙⣿⡄⠈⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠔⠊⠉⣿⡿⠁⠀⠀⠀
⠀⠀⠈⠣⡀⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠊⠁⠀⠀⣰⠟⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠈⠢⣄⠀⡈⠒⠊⠉⠁⠀⠈⠉⠑⠚⠀⠀⣀⠔⢊⣠⠤⠒⠊⡽⠀⠀
⠀⠀⠀⠀⠀⠀⠀⡽⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠩⡔⠊⠁⠀⠀⠀⠀⠀⠀⠇
⠀⠀⠀⠀⠀⠀⠀⡇⢠⡤⢄⠀⠀⠀⠀⠀⡠⢤⣄⠀⡇⠀⠀⠀⠀⠀⠀⠀⢰⠀
⠀⠀⠀⠀⠀⠀⢀⠇⠹⠿⠟⠀⠀⠤⠀⠀⠻⠿⠟⠀⣇⠀⠀⡀⠠⠄⠒⠊⠁⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣿⡆⠀⠰⠤⠖⠦⠴⠀⢀⣶⣿⣿⠀⠙⢄⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⠃⠀⠀⠀⠀⠀⠀⠀⠈⠿⡿⠛⢄⠀⠀⠱⣄⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢸⠈⠓⠦⠀⣀⣀⣀⠀⡠⠴⠊⠹⡞⣁⠤⠒⠉⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣠⠃⠀⠀⠀⠀⡌⠉⠉⡤⠀⠀⠀⠀⢻⠿⠆⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠰⠁⡀⠀⠀⠀⠀⢸⠀⢰⠃⠀⠀⠀⢠⠀⢣⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢶⣗⠧⡀⢳⠀⠀⠀⠀⢸⣀⣸⠀⠀⠀⢀⡜⠀⣸⢤⣶⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠻⣿⣦⣈⣧⡀⠀⠀⢸⣿⣿⠀⠀⢀⣼⡀⣨⣿⡿⠁⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠈⠻⠿⠿⠓⠄⠤⠘⠉⠙⠤⢀⠾⠿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀"""

pokemon = int(input("Qual pokemon seu vai para a batalha 1 2 ou 3 :") )
if pokemon == 1:
    while batalha_ativa:
        print ("Vamos lá")
        print (porygon)
        print (mudkip)
        print(f"Mudkip: {hp_jogador} HP  |  Porygon: {hp_inimigo} HP")
        print("O que Mudkip deve fazer?")
        print("1 -Atacar (Jato d'agua)")
        print("2 -Curar(Usar poção)")
        print("3 -Fugir (Tentar correr)")
        escolha = input("Digite o número da sua ação (1/2/3): ")
        if escolha == '1':
            dano = random.randint(1, 10)
            hp_inimigo -= dano
            print(f"Mukip usou Jato d'agua e causou {dano} de dano!")
            time.sleep(2)
            
        elif escolha == '2':
            cura = random.randint(1, 5)
            hp_jogador += cura
            
            if hp_jogador > 100:
                hp_jogador = 100
            print(f"Você usou uma Poção! Mudkip recuperou {cura} de HP.")
            time.sleep(2)
            
        elif escolha == '3':
            print("Mudkip fugiu da batalha em segurança!")
            batalha_ativa = False
            continue # O 'continue' pula para o final e encerra o loop imediatamente
        else:
            print("Opção invalida")
        derrota = """ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠀⡀⢀⠀⢠⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⢠⢤⣀⠀⠀⠀⠈⣆⢧⠈⡆⢸⠀⠀⠀⢰⢡⠇⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀
    ⠀⠀⠀⢀⠀⠀⣯⢀⣨⠃⠀⠀⠀⠸⡜⣄⣣⢸⠀⠀⠀⡜⡌⠀⠀⠀⠀⢀⡜⡁⠀⠀⠀⠀⠀
    ⠀⠀⠙⢮⡳⢄⠈⠁⠀⢠⠴⠍⣛⣚⣣⢳⢽⡀⣏⣲⣀⢧⡥⠤⠶⢤⣠⢎⠜⠁⠀⠀⠀⠀⠀
    ⠀⠠⣀⠀⠙⢦⡑⢄⢀⣾⣧⡎⠁⠀⠙⡎⡇⡇⡇⠹⢪⣀⡓⣦⢀⣼⣵⠋⢀⠴⣊⠔⠁⠀⠀
    ⠀⠀⠈⠑⢦⣀⠙⣲⣝⢭⡚⠃⠀⠀⠀⠸⠸⣹⠁⠀⠀⠀⠉⣹⣪⣎⡸⢞⡵⠊⠁⣀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠈⣷⢯⣨⠷⣝⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠵⣪⢶⣙⡤⠖⢉⣀⠤⠖⠂
    ⠀⠀⠀⠀⠀⢀⡞⢠⠾⠓⢮⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢬⣺⡯⢕⢲⠉⣥⣀⡀⠀⠀
    ⠀⠀⢀⡤⣀⢈⡷⠻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠘⠀⢱⢾⠘⢇⢴⠁⠀⠀
    ⠀⠀⢻⣀⡼⢘⣧⢀⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⢙⣞⠆⠀⠀⠀⠀⠀
    ⠀⠀⠀⠉⠀⢿⡀⠈⠧⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠇⣹⣦⠇⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠸⢤⡴⢺⡧⣴⡶⢗⡣⠀⡀⠀⠀⠀⡄⠀⢀⣄⠢⣔⡞⣤⠦⡇⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⣀⡤⣖⣯⡗⣪⢽⡻⣅⠀⣜⡜⠀⠀⠀⠸⡜⡌⣮⡣⡙⢗⢏⡽⠁⠰⡏⠙⡆⠀⠀
    ⠀⠀⣒⡭⠖⣋⡥⣞⣿⡚⠉⠉⢉⢟⣞⣀⣀⣀⠐⢦⢵⠹⡍⢳⡝⢮⡷⢝⢦⡀⠉⠙⠁⠀⠀
    ⠐⠊⢡⠴⠚⠕⠋⠹⣍⡉⠹⢧⢫⢯⣀⣄⣀⠈⣹⢯⣀⣧⢹⡉⠙⢦⠙⣄⠑⢌⠲⣄⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠘⠧⡴⣳⣃⣸⠦⠴⠖⢾⣥⠞⠛⠘⣆⢳⡀⠈⠳⡈⠳⡄⠁⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⢀⡜⡱⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡄⢣⠀⠀⠉⠀⠈⠂⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⢀⠞⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⡀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""
        if hp_inimigo <= 0:
            print(derrota)
            print("\nPorygon desmaiou!")
            print("VITÓRIA! Você ganhou 500 PokéDollars.")
            batalha_ativa = False
            continue # Sai do loop antes que o inimigo morto tente atacar

        # --- 5. TURNO DO INIMIGO ---
        print("\nTurno do inimigo...")
        # O inimigo ataca automaticamente se o jogo não acabou
        dano_inimigo = random.randint(1, 10)
        hp_jogador -= dano_inimigo
        print(f"Porigon usou Psiquico e causou {dano_inimigo} de dano no Mudkip!\n")

        # --- 6. CONDIÇÃO DE DERROTA ---
        # Verifica se o ataque do inimigo derrotou o jogador
        if hp_jogador <= 0:
            print("Mudkip desmaiou!")
            print("DERROTA! Você correu de volta para o Centro Pokémon.")
            batalha_ativa = False

elif pokemon == 2:
    while batalha_ativa:
        print ("Vamos lá")
        print (porygon)
        print (evee)
        print(f"Evee: {hp_jogador} HP  |  Porygon: {hp_inimigo} HP")
        print("O que Evee deve fazer?")
        print("1 -Atacar (Cabeçada)")
        print("2 -Curar(Usar poção)")
        print("3 -Fugir (Tentar correr)")
        escolha = input("Digite o número da sua ação (1/2/3): ")
        if escolha == '1':
            dano = random.randint(1, 10)
            hp_inimigo -= dano
            print(f"Evee usou Cabeçada e causou {dano} de dano!")
            time.sleep(2)
            
        elif escolha == '2':
            # Cura: Recupera um valor aleatório entre 20 e 30
            cura = random.randint(1, 5)
            hp_jogador += cura
            
            if hp_jogador > 100:
                hp_jogador = 100
            print(f"Você usou uma Poção! Evee recuperou {cura} de HP.")
            time.sleep(2)
            
        elif escolha == '3':
            # Fuga: Encerra o laço 'while'
            print("Evee fugiu da batalha em segurança!")
            batalha_ativa = False
            continue # O 'continue' pula para o final e encerra o loop imediatamente
        else:
            print("Opção invalida")
        derrota = """ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠀⡀⢀⠀⢠⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⢠⢤⣀⠀⠀⠀⠈⣆⢧⠈⡆⢸⠀⠀⠀⢰⢡⠇⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀
    ⠀⠀⠀⢀⠀⠀⣯⢀⣨⠃⠀⠀⠀⠸⡜⣄⣣⢸⠀⠀⠀⡜⡌⠀⠀⠀⠀⢀⡜⡁⠀⠀⠀⠀⠀
    ⠀⠀⠙⢮⡳⢄⠈⠁⠀⢠⠴⠍⣛⣚⣣⢳⢽⡀⣏⣲⣀⢧⡥⠤⠶⢤⣠⢎⠜⠁⠀⠀⠀⠀⠀
    ⠀⠠⣀⠀⠙⢦⡑⢄⢀⣾⣧⡎⠁⠀⠙⡎⡇⡇⡇⠹⢪⣀⡓⣦⢀⣼⣵⠋⢀⠴⣊⠔⠁⠀⠀
    ⠀⠀⠈⠑⢦⣀⠙⣲⣝⢭⡚⠃⠀⠀⠀⠸⠸⣹⠁⠀⠀⠀⠉⣹⣪⣎⡸⢞⡵⠊⠁⣀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠈⣷⢯⣨⠷⣝⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠵⣪⢶⣙⡤⠖⢉⣀⠤⠖⠂
    ⠀⠀⠀⠀⠀⢀⡞⢠⠾⠓⢮⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢬⣺⡯⢕⢲⠉⣥⣀⡀⠀⠀
    ⠀⠀⢀⡤⣀⢈⡷⠻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠘⠀⢱⢾⠘⢇⢴⠁⠀⠀
    ⠀⠀⢻⣀⡼⢘⣧⢀⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⢙⣞⠆⠀⠀⠀⠀⠀
    ⠀⠀⠀⠉⠀⢿⡀⠈⠧⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠇⣹⣦⠇⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠸⢤⡴⢺⡧⣴⡶⢗⡣⠀⡀⠀⠀⠀⡄⠀⢀⣄⠢⣔⡞⣤⠦⡇⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⣀⡤⣖⣯⡗⣪⢽⡻⣅⠀⣜⡜⠀⠀⠀⠸⡜⡌⣮⡣⡙⢗⢏⡽⠁⠰⡏⠙⡆⠀⠀
    ⠀⠀⣒⡭⠖⣋⡥⣞⣿⡚⠉⠉⢉⢟⣞⣀⣀⣀⠐⢦⢵⠹⡍⢳⡝⢮⡷⢝⢦⡀⠉⠙⠁⠀⠀
    ⠐⠊⢡⠴⠚⠕⠋⠹⣍⡉⠹⢧⢫⢯⣀⣄⣀⠈⣹⢯⣀⣧⢹⡉⠙⢦⠙⣄⠑⢌⠲⣄⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠘⠧⡴⣳⣃⣸⠦⠴⠖⢾⣥⠞⠛⠘⣆⢳⡀⠈⠳⡈⠳⡄⠁⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⢀⡜⡱⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡄⢣⠀⠀⠉⠀⠈⠂⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⢀⠞⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⡀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""
        if hp_inimigo <= 0:
            print(derrota)
            print("\nPorygon desmaiou!")
            print("VITÓRIA! Você ganhou 500 PokéDollars.")
            batalha_ativa = False
            continue # Sai do loop antes que o inimigo morto tente atacar

        # --- 5. TURNO DO INIMIGO ---
        print("\nTurno do inimigo...")
        # O inimigo ataca automaticamente se o jogo não acabou
        dano_inimigo = random.randint(1, 10)
        hp_jogador -= dano_inimigo
        print(f"Porigon usou Psiquico e causou {dano_inimigo} de dano no Evee!\n")

        # --- 6. CONDIÇÃO DE DERROTA ---
        # Verifica se o ataque do inimigo derrotou o jogador
        if hp_jogador <= 0:
            print("Evee desmaiou!")
            print("DERROTA! Você correu de volta para o Centro Pokémon.")
            batalha_ativa = False
elif pokemon == 3:
    while batalha_ativa:
            print ("Vamos lá")
            print (porygon)
            print (pikachu)
            print(f"Pikachu: {hp_jogador} HP  |  Porygon: {hp_inimigo} HP")
            print("O que Pikachu deve fazer?")
            print("1 -Atacar (Choque do Trovão)")
            print("2 -Curar(Usar poção)")
            print("3 -Fugir (Tentar correr)")
            escolha = input("Digite o número da sua ação (1/2/3): ")
            if escolha == '1':
                # Ataque: Gera um dano aleatório entre 15 e 25
                dano = random.randint(1, 10)
                hp_inimigo -= dano
                print(f"Pikachu usou Choque do Trovão e causou {dano} de dano!")
                time.sleep(2)
                
            elif escolha == '2':
                # Cura: Recupera um valor aleatório entre 20 e 30
                cura = random.randint(1, 5)
                hp_jogador += cura
               
                if hp_jogador > 100:
                    hp_jogador = 100
                print(f"Você usou uma Poção! Pikachu recuperou {cura} de HP.")
                time.sleep(2)
                
            elif escolha == '3':
                print("Pikachu fugiu da batalha em segurança!")
                batalha_ativa = False
                continue 
            else:
                print("Opção invalida")
            derrota = """ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠀⡀⢀⠀⢠⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⢠⢤⣀⠀⠀⠀⠈⣆⢧⠈⡆⢸⠀⠀⠀⢰⢡⠇⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀
        ⠀⠀⠀⢀⠀⠀⣯⢀⣨⠃⠀⠀⠀⠸⡜⣄⣣⢸⠀⠀⠀⡜⡌⠀⠀⠀⠀⢀⡜⡁⠀⠀⠀⠀⠀
        ⠀⠀⠙⢮⡳⢄⠈⠁⠀⢠⠴⠍⣛⣚⣣⢳⢽⡀⣏⣲⣀⢧⡥⠤⠶⢤⣠⢎⠜⠁⠀⠀⠀⠀⠀
        ⠀⠠⣀⠀⠙⢦⡑⢄⢀⣾⣧⡎⠁⠀⠙⡎⡇⡇⡇⠹⢪⣀⡓⣦⢀⣼⣵⠋⢀⠴⣊⠔⠁⠀⠀
        ⠀⠀⠈⠑⢦⣀⠙⣲⣝⢭⡚⠃⠀⠀⠀⠸⠸⣹⠁⠀⠀⠀⠉⣹⣪⣎⡸⢞⡵⠊⠁⣀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠈⣷⢯⣨⠷⣝⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠵⣪⢶⣙⡤⠖⢉⣀⠤⠖⠂
        ⠀⠀⠀⠀⠀⢀⡞⢠⠾⠓⢮⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢬⣺⡯⢕⢲⠉⣥⣀⡀⠀⠀
        ⠀⠀⢀⡤⣀⢈⡷⠻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠘⠀⢱⢾⠘⢇⢴⠁⠀⠀
        ⠀⠀⢻⣀⡼⢘⣧⢀⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⢙⣞⠆⠀⠀⠀⠀⠀
        ⠀⠀⠀⠉⠀⢿⡀⠈⠧⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠇⣹⣦⠇⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠸⢤⡴⢺⡧⣴⡶⢗⡣⠀⡀⠀⠀⠀⡄⠀⢀⣄⠢⣔⡞⣤⠦⡇⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⣀⡤⣖⣯⡗⣪⢽⡻⣅⠀⣜⡜⠀⠀⠀⠸⡜⡌⣮⡣⡙⢗⢏⡽⠁⠰⡏⠙⡆⠀⠀
        ⠀⠀⣒⡭⠖⣋⡥⣞⣿⡚⠉⠉⢉⢟⣞⣀⣀⣀⠐⢦⢵⠹⡍⢳⡝⢮⡷⢝⢦⡀⠉⠙⠁⠀⠀
        ⠐⠊⢡⠴⠚⠕⠋⠹⣍⡉⠹⢧⢫⢯⣀⣄⣀⠈⣹⢯⣀⣧⢹⡉⠙⢦⠙⣄⠑⢌⠲⣄⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠘⠧⡴⣳⣃⣸⠦⠴⠖⢾⣥⠞⠛⠘⣆⢳⡀⠈⠳⡈⠳⡄⠁⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⢀⡜⡱⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡄⢣⠀⠀⠉⠀⠈⠂⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⢀⠞⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⡀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""
            if hp_inimigo <= 0:
                print(derrota)
                print("\nPorygon desmaiou!")
                print("VITÓRIA! Você ganhou 500 PokéDollars.")
                batalha_ativa = False
                continue

            print("\nTurno do inimigo...")
            dano_inimigo = random.randint(1, 10)
            hp_jogador -= dano_inimigo
            print(f"Porigon usou Psiquico e causou {dano_inimigo} de dano no Pikachu!\n")


            if hp_jogador <= 0:
                print("Pikachu desmaiou!")
                print("DERROTA! Você correu de volta para o Centro Pokémon.")
                batalha_ativa = False

